app/views/stories/_listdetail.html.erb

SELECT `tags`.* FROM `tags` WHERE `tags`.`tag` = 'mumbai' LIMIT 1
---
        <% story.taggings.sort_by{|t| t.tag.tag }.sort_by{|t|
        t.tag.tag == "pdf" ? -1 : 0 }.each do |tagging| %>